private/README.org


#+TITLE: Título do Documento
#+AUTHOR: Guaracy Monteiro
#+EXPORT_FILE_NAME: README

Por enquanto, apenas para testes.

* Arquivos

O arquivo /.myemacs/ será carregado ao final do arquivo de configuração /.emacs/. É importante que as alterações sejam efetuadas neste arquivo e não no arquivo /.emacs/.



#+begin_src lisp
;;-----------------------------------------
;; ## Cancela alterações no buffer
;;
(defun  revert-buffer-preserve-modes  ()
  (interactive)
  (revert-buffer  t  nil  t))
(global-set-key (kbd "<f5>") 'revert-buffer-preserve-modes )
#+end_src

