private/README.tex
% Created 2016-01-14 Qui 10:08
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Guaracy Monteiro}
\date{\today}
\title{Título do Documento}
\hypersetup{
 pdfauthor={Guaracy Monteiro},
 pdftitle={Título do Documento},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

Por enquanto, apenas para testes.

\section{Arquivos}
\label{sec:orgheadline1}

O arquivo \emph{.myemacs} será carregado ao final do arquivo de configuração \emph{.emacs}. É importante que as alterações sejam efetuadas neste arquivo e não no arquivo \emph{.emacs}.

\begin{verbatim}
;;-----------------------------------------
;; ## Cancela alterações no buffer
;;
(defun  revert-buffer-preserve-modes  ()
  (interactive)
  (revert-buffer  t  nil  t))
(global-set-key (kbd "<f5>") 'revert-buffer-preserve-modes )
\end{verbatim}
\end{document}
